//
//  KnowledgeGuide.swift
//  SwiftPamphletApp
//
//  Created by Ming Dai on 2025/3/25.
//

import Foundation

struct KnowledgeGuide {
    var outline = [
        L(t: "历史", sub: [
            L(t: "时间轴",sub: [
                L(t: "西周", sub: [
                    L(t: "公元前1046年西周建立", type: 1),
                    L(t: "公元前985年周昭王攻荆楚之战", type: 1),
                    L(t: "公元前976年周穆王西行", type: 1),
                    L(t: "公元前891年周孝王分封非子", type: 1),
                    L(t: "公元前842年国人暴动", type: 1),
                    L(t: "公元前841年宣王中兴", type: 1),
                    L(t: "公元前789年千亩之战", type: 1),
                    L(t: "公元前782年周幽王失国", type: 1),
                    L(t: "公元前771年犬戎之祸西周灭亡", type: 1)
                ]),
                L(t: "春秋战国", sub: [
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前725年管仲相齐", type: 1),
                    L(t: "公元前720年周郑交质", type: 1),
                    L(t: "公元前707年郑伯掘突", type: 1),
                    L(t: "公元前685年齐桓公", type: 1),
                    L(t: "公元前681年九合诸侯", type: 1),
                    L(t: "公元前659年秦穆公", type: 1),
                    L(t: "公元前656年骊姬之乱", type: 1),
                    L(t: "公元前650年宋襄公", type: 1),
                    L(t: "公元前638年泓水之战", type: 1),
                    L(t: "公元前636年晋文公", type: 1),
                    L(t: "公元前632年城濮之战", type: 1),
                    L(t: "公元前630年易牙烹子侍恒公", type: 1),
                    L(t: "公元前627年秦晋殽之战与烛之武退秦师", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                ]),
            ]),
            
        ])
    ]
}
