//
//  KnowledgeGuide.swift
//  SwiftPamphletApp
//
//  Created by Ming Dai on 2025/3/25.
//

import Foundation

struct KnowledgeGuide {
    var outline = [
        L(t: "历史", sub: [
            L(t: "历史时间轴", sub: [
                L(t: "公元前1046年"),
                L(t: "公元前1045年"),
                L(t: "公元前1044年"),
                L(t: "公元前1043年"),
                L(t: "公元前1042年"),
                L(t: "公元前1041年"),
                L(t: "公元前1040年"),
                L(t: "公元前1039年"),
                L(t: "公元前1038年"),
                L(t: "公元前1037年"),
                L(t: "公元前1036年"),
                L(t: "公元前1035年"),
                L(t: "公元前1034年"),
                L(t: "公元前1033年"),
                L(t: "公元前1032年"),
                L(t: "公元前1031年"),
                L(t: "公元前1030年"),
                L(t: "公元前1029年"),
                L(t: "公元前1028年"),
                L(t: "公元前1027年"),
                L(t: "公元前1026年"),
                L(t: "公元前1025年"),
                L(t: "公元前1024年"),
                L(t: "公元前1023年"),
                L(t: "公元前1022年"),
                L(t: "公元前1021年"),
                L(t: "公元前1020年"),
                L(t: "公元前1019年"),
                L(t: "公元前1018年"),
                L(t: "公元前1017年"),
                L(t: "公元前1016年"),
                L(t: "公元前1015年"),
            ])
        ])
    ]
}
