//
//  KnowledgeGuide.swift
//  SwiftPamphletApp
//
//  Created by Ming Dai on 2025/3/25.
//

import Foundation

struct KnowledgeGuide {
    var outline = [
        L(t: "历史", sub: [
            L(t: "时间轴",sub: [
                L(t: "西周", sub: [
                    L(t: "公元前1046年西周建立", type: 1),
                    L(t: "公元前985年周昭王攻荆楚之战", type: 1),
                    L(t: "公元前976年周穆王西行", type: 1),
                    L(t: "公元前891年周孝王分封非子", type: 1),
                    L(t: "公元前842年国人暴动", type: 1),
                    L(t: "公元前841年宣王中兴", type: 1),
                    L(t: "公元前789年千亩之战", type: 1),
                    L(t: "公元前782年周幽王失国", type: 1),
                    L(t: "公元前771年犬戎之祸西周灭亡", type: 1)
                ]),
                L(t: "春秋战国", sub: [
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前725年管仲相齐", type: 1),
                    L(t: "公元前720年周郑交质", type: 1),
                    L(t: "公元前707年郑伯掘突", type: 1),
                    L(t: "公元前685年齐桓公", type: 1),
                    L(t: "公元前681年九合诸侯", type: 1),
                    L(t: "公元前659年秦穆公", type: 1),
                    L(t: "公元前656年骊姬之乱", type: 1),
                    L(t: "公元前650年宋襄公", type: 1),
                    L(t: "公元前638年泓水之战", type: 1),
                    L(t: "公元前636年晋文公", type: 1),
                    L(t: "公元前632年城濮之战", type: 1),
                    L(t: "公元前630年易牙烹子侍恒公", type: 1),
                    L(t: "公元前627年秦晋殽之战与烛之武退秦师", type: 1),
                    L(t: "公元前613年楚庄王", type: 1),
                    L(t: "公元前606年问鼎中原", type: 1),
                    L(t: "公元前601年孙叔敖", type: 1),
                    L(t: "公元前597年邲之战", type: 1),
                    L(t: "公元前594年鲁初税亩", type: 1),
                    L(t: "公元前590年诗经", type: 1),
                    L(t: "公元前579年弭兵会盟", type: 1),
                    L(t: "公元前570年老子与道家思想", type: 1),
                    L(t: "公元前551年孔子与儒家思想", type: 1),
                    L(t: "公元前515年孙子兵法", type: 1),
                    L(t: "公元前514年吴王阖闾", type: 1),
                    L(t: "公元前510年道德经", type: 1),
                    L(t: "公元前506年柏举之战", type: 1),
                    L(t: "公元前507年鲁班", type: 1),
                    L(t: "公元前496年越王勾践", type: 1),
                    L(t: "公元前476年战国七雄", type: 1),
                    L(t: "公元前475年越灭吴之战", type: 1),
                    L(t: "公元前422年魏国李悝变法", type: 1),
                    L(t: "公元前404年百家争鸣", type: 1),
                    L(t: "公元前403年三家分晋", type: 1),
                    L(t: "公元前386年楚国吴起变法", type: 1),
                    L(t: "公元前356年商鞅变法", type: 1),
                    L(t: "公元前354年邯郸之难", type: 1),
                    L(t: "公元前344年逢泽之会", type: 1),
                    L(t: "公元前323年公孙衍与五国相王", type: 1),
                    L(t: "公元前318年合纵连横", type: 1),
                    L(t: "公元前315年蔺相如", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                    L(t: "公元前770年平王东迁", type: 1),
                ]),
            ]),
            
        ])
    ]
}
